text/chart_style/c4_assert_equal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-08 火 22:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>チャート式Ruby class[4] assert_equal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">チャート式Ruby class[4] assert_equal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org41e7039">1. お題:assert_equal</a></li>
<li><a href="#org84704c5">2. 解法:red,green</a></li>
<li><a href="#org0ce8a46">3. 解説:colorize-出色の継承-</a></li>
<li><a href="#org2cc7061">4. 改良:richer output</a></li>
<li><a href="#org39c92c5">5. 拡張:assert_not_equal</a></li>
<li><a href="#org45a9644">6. 整理:重複箇所の整理</a></li>
<li><a href="#orgeecfae6">7. 補足:重複実行の予防</a></li>
</ul>
</div>
</div>

<div id="outline-container-org41e7039" class="outline-2">
<h2 id="org41e7039"><span class="section-number-2">1</span> お題:assert_equal</h2>
<div class="outline-text-2" id="text-1">
<p>
テスト駆動開発で今後の学習を進めて行くんですが，
その根本となるassert_equalを作って置きます．
assert equalとはequalかどうかを確かめる(assert)関数です．
どんなのでもいいんですが，自分で作ると好きにできますんで，
その様子を見てもらいましょう．
</p>
</div>
</div>

<div id="outline-container-org84704c5" class="outline-2">
<h2 id="org84704c5"><span class="section-number-2">2</span> 解法:red,green</h2>
<div class="outline-text-2" id="text-2">
<p>
まずは1==1です．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
ruby: No such file or directory -- assert_equal.rb (LoadError)
</pre>
<p>
もちろんないんで，それをemacsします．
</p>
<div class="org-src-container">
<pre class="src src-ruby">p 1==1
</pre>
</div>
<p>
として見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
true
</pre>
<p>
と返ってきてますか？
</p>

<p>
これをmethodにします．英語の感覚だと，
</p>
<pre class="example">
assert equal expected and result

</pre>
<p>
とでもなるでしょうか．なんで，
</p>
<pre class="example">
assert_equal(expected, result)

</pre>
<p>
という感じです．まずはred
</p>
<div class="org-src-container">
<pre class="src src-ruby">p assert_equal(1, 1)
</pre>
</div>
<p>
として見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
assert_equal.rb:1:in `&lt;main&gt;': undefined method `assert_equal' for main:Object (NoMethodError)
</pre>
<p>
関数がないと怒られますよね．
それなら，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">return</span> expected == result
<span style="color: #a020f0;">end</span>

p assert_equal(1, 1)
</pre>
</div>
<p>
なら動くし，ちゃんとtrueが返ってますよね．
</p>
</div>
</div>

<div id="outline-container-org0ce8a46" class="outline-2">
<h2 id="org0ce8a46"><span class="section-number-2">3</span> 解説:colorize-出色の継承-</h2>
<div class="outline-text-2" id="text-3">
<p>
これだけだと，殺風景なんで，red, green, refactoringという標語に
したがって動作するように変えます．
肝は，colorizeです．
</p>

<div class="org-src-container">
<pre class="src src-ruby">require <span style="color: #8b2252;">'colorize'</span>

<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">if</span> expected == result
    puts <span style="color: #8b2252;">'true'</span>.green
  <span style="color: #a020f0;">else</span>
    puts <span style="color: #8b2252;">'false'</span>.red
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

assert_equal(1, 1)
</pre>
</div>
<p>
どうです．greenでしょ？
</p>

<p>
ならtestにredも付け加えて置きましょう．
</p>
<pre class="example">
assert_equal(1, 2)

</pre>
<p>
redでしょ？
</p>

<p>
colorizeというgem libraryがないと怒られたなら
</p>
<pre class="example">
&gt; gem install colorize
</pre>
<p>
でinstallしてください．
関学のproxyで引っかかっている人は，
</p>
<pre class="example">
&gt; gem install colorize -r -p http://proxy.ksc.kwansei.ac.jp:8080

</pre>
<p>
してください．
</p>

<p>
gemというのはrubyのlibraryを管理するシステムです．
色々出せますんで，試してみてください．
</p>

<div class="org-src-container">
<pre class="src src-ruby">&gt; irb
irb(main)<span style="color: #008b8b;">:001</span>:0&gt; require <span style="color: #8b2252;">'colorize'</span>
=&gt; <span style="color: #a0522d;">true</span>
irb(main)<span style="color: #008b8b;">:002</span>:0&gt; <span style="color: #228b22;">String</span>.colors
=&gt; [<span style="color: #008b8b;">:black</span>, <span style="color: #008b8b;">:light_black</span>, <span style="color: #008b8b;">:red</span>, <span style="color: #008b8b;">:light_red</span>, <span style="color: #008b8b;">:green</span>, <span style="color: #008b8b;">:light_green</span>, <span style="color: #008b8b;">:yellow</span>, <span style="color: #008b8b;">:light_yellow</span>, <span style="color: #008b8b;">:blue</span>, <span style="color: #008b8b;">:light_blue</span>, <span style="color: #008b8b;">:magenta</span>, <span style="color: #008b8b;">:light_magenta</span>, <span style="color: #008b8b;">:cyan</span>, <span style="color: #008b8b;">:light_cyan</span>, <span style="color: #008b8b;">:white</span>, <span style="color: #008b8b;">:light_white</span>, <span style="color: #008b8b;">:default</span>]
</pre>
</div>
<p>
colorizeは，ruby標準のString classに色を表示するmethodを上載せ(override)します．
こんなのがすぐに使えて色々あるのがrubyです．いや，object思考です．
</p>
</div>
</div>

<div id="outline-container-org2cc7061" class="outline-2">
<h2 id="org2cc7061"><span class="section-number-2">4</span> 改良:richer output</h2>
<div class="outline-text-2" id="text-4">
<p>
もう少し出力をrichにしましょう．
</p>
<ul class="org-ul">
<li>引数でとってきた，expected, resultの値をそのまま出力</li>
<li>どうなったかを記述
<dl class="org-dl">
<dt>true</dt><dd>print "succeeded in assert_equal.\n".green</dd>
<dt>false</dt><dd>print "failed in assert_equal.\n".red</dd>
</dl></li>
</ul>

<p>
どうです．できました？
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>assert_equal_richer_output.rb, Not Yet and Need Revise.</label><pre class="src src-ruby">require <span style="color: #8b2252;">'colorize'</span>

<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">if</span> expected == result
    puts <span style="color: #8b2252;">'true'</span>.green
  <span style="color: #a020f0;">else</span>
    puts <span style="color: #8b2252;">'false'</span>.red
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

assert_equal(1, 1)
assert_equal(1, 2)
</pre>
</div>
</div>
</div>
<div id="outline-container-org39c92c5" class="outline-2">
<h2 id="org39c92c5"><span class="section-number-2">5</span> 拡張:assert_not_equal</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
assert_not_equal(1, 2)

</pre>
<p>
を考えましょう．まずはtestです．上のんを入れて実行して見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
expected :: 1
result   :: 1
succeeded in assert_equal.
expected :: 1
result   :: 2
failed in assert_equal.
assert_equal.rb:15:in `&lt;main&gt;': undefined method `assert_not_equal' for main:Object (NoMethodError)
Did you mean?  assert_equal
</pre>
<p>
なんかが返ってくるでしょうか．関数がないと怒られます．
まずはcopy &amp; pasteします．
関数名だけassert_equalからassert_not_equalに直しましょう．
</p>
<pre class="example">
expected :: 1
result   :: 2
failed in assert_equal.
</pre>
<p>
となります．このままだと，振る舞いがおかしいですよね．
修正します．
</p>
<pre class="example">
expected :: 1
result   :: 2
succeeded in assert_not_equal.
</pre>
<p>
となればOKです．
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>assert_not_equal.rb, Not Yet and Need Revise.</label><pre class="src src-ruby">require <span style="color: #8b2252;">'colorize'</span>

<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">if</span> expected == result
    puts <span style="color: #8b2252;">'true'</span>.green
  <span style="color: #a020f0;">else</span>
    puts <span style="color: #8b2252;">'false'</span>.red
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

assert_equal(1, 1)
assert_equal(1, 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-org45a9644" class="outline-2">
<h2 id="org45a9644"><span class="section-number-2">6</span> 整理:重複箇所の整理</h2>
<div class="outline-text-2" id="text-6">
<p>
重複している箇所は整理して，別立ての関数にしてください．
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>./assert_not_equal_with_puts.rb, Not Yet and Need Revise.</label><pre class="src src-ruby">require <span style="color: #8b2252;">'colorize'</span>

<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">if</span> expected == result
    puts <span style="color: #8b2252;">'true'</span>.green
  <span style="color: #a020f0;">else</span>
    puts <span style="color: #8b2252;">'false'</span>.red
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

assert_equal(1, 1)
assert_equal(1, 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeecfae6" class="outline-2">
<h2 id="orgeecfae6"><span class="section-number-2">7</span> 補足:重複実行の予防</h2>
<div class="outline-text-2" id="text-7">
<p>
このcodeは今後繰り返し使っています．
そのためには，requireで呼び出す必要があります．
同じdirectoryに写(copy)して使うようにします．
</p>

<p>
例えば，
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="color: #8b2252;">'./assert_equal'</span>

assert_equal(2, 1*2)
assert_not_equal(<span style="color: #8b2252;">'bob'</span>, <span style="color: #8b2252;">'bob2'</span>)
</pre>
</div>
<p>
というように使います．
</p>

<p>
しかし，今のままだとassert_equal.rbに書いたテストがそのまま実行されてしまいます．
そこで，そういうのを回避してくれるidiom(熟語)があります．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">if</span> <span style="color: #a0522d;">$PROGRAM_NAME</span> == __FILE__
  assert_equal(1, 1)
  assert_equal(1, 2)
  assert_not_equal(1, 2)
  assert_not_equal(1, 1)
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
です．意味は，codeが書いてあるファイル名(<span class="underline"><span class="underline">FILE</span></span>)が，
動いているファイル名($PROGRAM_NAME)と
一致したら中身を実行です．
これはidiomなんで&#x2026;覚えてください．あ，ここに書いてあるということをね．
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>codes/assert_equal_final.rb, Not Yet and Need Revise.</label><pre class="src src-ruby">require <span style="color: #8b2252;">'colorize'</span>

<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">assert_equal</span>(expected, result)
  <span style="color: #a020f0;">if</span> expected == result
    puts <span style="color: #8b2252;">'true'</span>.green
  <span style="color: #a020f0;">else</span>
    puts <span style="color: #8b2252;">'false'</span>.red
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

assert_equal(1, 1)
assert_equal(1, 2)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-08 火 22:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
